// Задача 00
Console.WriteLine("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine()); // командой Convert.ToInt32 преобразуем строку в число
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");

